// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
// A (3,6,8); B (2,1,-7), -> 15.84
// A (7,-5, 0); B (1,-1,9) -> 11.53
Console.WriteLine("Введите координату А");
double A1 = double.Parse(Console.ReadLine()!);
double A2 = double.Parse(Console.ReadLine()!);
double A3 = double.Parse(Console.ReadLine()!);
Console.WriteLine("Введите координату В");
double B1 = double.Parse(Console.ReadLine()!);
double B2 = double.Parse(Console.ReadLine()!);
double B3 = double.Parse(Console.ReadLine()!);


